[
  {
    "order": 1,
    "image": "mallexsmith.jpg",
    "overlay": "right",
    "name": "Mallex Smith",
    "number": 0,
    "position": "CF",
    "card": "Mariners-baseballcards2019-Mallex.jpg",
    "age": 25,
    "height": "5-10",
    "weight": 180,
    "arm": "Bats",
    "bats": "Left",
    "season": ".296|65|2|40|40|.367|.406",
    "career": ".277|126|7|74|72|.346|.384",
    "best": "For their new center fielder to be healthy, and to make a full recovery from the elbow strain that forced him to miss the season-opening series in Japan. The Mariners will also need the speedy Smith to be a terror on the basepaths and at least equal the 40 stolen bases he had last season with Tampa Bay while keeping his batting average near last season’s .296 and his on-base percentage near last season’s .367",
    "worst": "Was a Mariner for 77 minutes in 2016. Seattle acquired Smith in a trade with Atlanta, and shortly after  the Mariners dealt Smith to Tampa Bay.",
    "credit": "Dean Rutz",
    "publication": "The Seattle Times"
  },
  {
    "order": 2,
    "image": "jaybruce.jpg",
    "overlay": "right",
    "name": "Jay Bruce",
    "number": 32,
    "position": "1B",
    "card": "Mariners-baseballcards2019-Bruce.jpg",
    "age": 31,
    "height": "6-3",
    "weight": 225,
    "arm": "Bats",
    "bats": "Left",
    "season": ".223|31|9|37|2|.310|.370",
    "career": ".247|782|286|875|64|.318|.466",
    "best": "For the veteran to rebound from the worst offensive season of his career. His solid performance during spring training seems to be a good sign that can happen. It seems unlikely that Bruce will be a part of the Mariners’ long-term plans no matter how he performs, but if his power numbers return to their normal levels, his trade value will greatly increase",
    "worst": "He has hit at least 21 homers in nine of his 11 big-league seasons. … He is a three-time National League All-Star.",
    "credit": "Dean Rutz",
    "publication": "The Seattle Times"
  },
  {
    "order": 3,
    "image": "deegordon.jpg",
    "overlay": "right",
    "name": "Dee Gordon",
    "number": 9,
    "position": "2B",
    "card": "Mariners-baseballcards2019-Gordon.jpg",
    "age": 30,
    "height": "5-11",
    "weight": 170,
    "arm": "Bats",
    "bats": "Left",
    "season": ".268|62|4|36|30|.288|.349",
    "career": ".289|484|977|15|197|308|.322|.364",
    "best": "A lot more than they got last season, one of the worst seasons of the speedy second baseman’s career. His on-base percentage was his worst since 2012 and his 30 stolen baes were half of what he had with Miami the year before. It would help if he could avoid the nagging injuries that he had last season. At least he won’t have the pressure of having to learn how to play center field this season.",
    "worst": "Gordon was a star basketball player at Avon Park (Fla.) High School and did not play organized baseball until he was 16. … Was offered a basketball scholarship by Louisville.",
    "credit": "Dean Rutz",
    "publication": "The Seattle Times"
  },
  {
    "order": 4,
    "image": "ryonhealy.jpg",
    "overlay": "left",
    "name": "Ryon Healy",
    "number": 27,
    "position": "3B",
    "card": "Mariners-baseballcards2019-Healy.jpg",
    "age": 27,
    "height": "6-5",
    "weight": 225,
    "arm": "Bats",
    "bats": "Right",
    "season": ".235|51|24|73|0|.277|.412",
    "career": ".265|153|62|188|0|.300|.451",
    "best": "They need Healy to do a good job replacing Kyle Seager at third base while he recovers from hand surgery, and to perform well enough that the Mariners will need to figure a spot for him on the roster once Seager returns. It was speculated that Healy was heading to Class AAA Tacoma before Seager’s injury after his numbers took a big drop last season, with his .277 on-base percentage and the .688 OPS particularly alarming.",
    "worst": "He was a standout pitcher at Crespi Carmelite High School in Encino, Calif., going 11-0 as a junior with a 1.81 ERA and 101 Ks in 91 innings.",
    "credit": "Dean Rutz",
    "publication": "The Seattle Times"
  },
  {
    "order": 5,
    "image": "mitchhaniger.jpg",
    "overlay": "right",
    "name": "Mitch Haniger",
    "number": 17,
    "position": "RF",
    "card": "Mariners-baseballcards2019-Haniger.jpg",
    "age": 28,
    "height": "6-2",
    "weight": 215,
    "arm": "Bats",
    "bats": "Right",
    "season": ".285|90|26|93|8|.366|.493",
    "career": ".278|157|47|157|13|.356|.483",
    "best": "To continue his upward trend and once again play at an All-Star level. If he can do that, he is a player that the Mariners can build around as they begin the rebuilding process. He played in 157 games last season and the Mariners will need him to show that same kind of durability this season.",
    "worst": "As a freshman at Cal Poly (San Luis Obispo), he was named Big West Conference Freshman Field Player of the Year and as a junior was named Big West Field Player of the Year. … Was star receiver in high school on the Archbishop Mitty (San Jose, Calif.) football team.",
    "credit": "Dean Rutz",
    "publication": "The Seattle Times"
  },
  {
    "order": 6,
    "image": "domingosantana.jpg",
    "overlay": "left",
    "name": "Domingo Santana",
    "number": 16,
    "position": "LF",
    "card": "Mariners-baseballcards2019-Santana.jpg",
    "age": 26,
    "height": "6-5",
    "weight": 220,
    "arm": "Bats",
    "bats": "Right",
    "season": ".265|21|5|20|1|.328|.412",
    "career": ".261|164|54|163|22|.349|.458",
    "best": "The power he showed in 2017 with the Milwaukee Brewers when he had 30 homers in 525 at-bats, and not the punchless season he had last year when he had five homers in 211 at-bats and was demoted to Class AAA in midseason. His OPS went from .878 in 2017 to .740 last season. Seattle would certainly be happy if he cuts back on his alarming number of strikeouts. He whiffed 178 times in 2017 and struck out at an even greater pace last season (77). ",
    "worst": "His father, also Domingo, was an outfielder/pitcher in the Astros farm system.",
    "credit": "Dean Rutz",
    "publication": "The Seattle Times"
  },
  {
    "order": 7,
    "image": "edwinencarnacion.jpg",
    "overlay": "right",
    "name": "Edwin Encarnacion",
    "number": 10,
    "position": "DH",
    "card": "Mariners-baseballcards2019-Encarnacion.jpg",
    "age": 36,
    "height": "6-1",
    "weight": 230,
    "arm": "Bats",
    "bats": "Right",
    "season": ".246|74|32|107|3|.336|.474",
    "career": ".264|999|380|1156|61|.353|.497",
    "best": "Another season in which he hits more than 30 home runs and has more than 100 runs batted in, something he has done in six of the past seven seasons, and missed by just a couple of RBI in 2014. That would not only replace the power lost with the exit of Nelson Cruz, it would also make him more valuable in a potential trade.",
    "worst": "Edwin’s father Elpido was a track and field star in the Dominican Republic and later coached the sport. In 1975, he competed in the decathlon at the Pan-American Games against Bruce (now Caitlyn) Jenner.",
    "credit": "Dean Rutz",
    "publication": "The Seattle Times"
  },
  {
    "order": 8,
    "image": "omarnarvaez.jpg",
    "overlay": "right",
    "name": "Omar Narvaez",
    "number": 22,
    "position": "C",
    "card": "Mariners-baseballcards2019-Narvaez.jpg",
    "age": 27,
    "height": "5-11",
    "weight": 215,
    "arm": "Bats",
    "bats": "Left",
    "season": ".275|30|9|30|0|.366|.429",
    "career": ".274|66|12|54|0|.366|.379",
    "best": "The continued progression he saw in his offensive numbers in his first three years in the big leagues, and solid defense and leadership behind the plate. The Mariners likely would take a repeat of last season’s .795 OPS. He had nine homers in 280 at-bats, compared to two in 253 the year before. He threw out just 20 percent of runners trying to steal against him last season (13 of 65) and the M’s would certainly like that to improve.",
    "worst": "The second home run of his career, in July 2017, came against the Mariners off starter Andrew Moore.",
    "credit": "Dean Rutz",
    "publication": "The Seattle Times"
  },
  {
    "order": 9,
    "image": "timbeckham.jpg",
    "overlay": "right",
    "name": "Tim Beckham",
    "number": 1,
    "position": "SS",
    "card": "Mariners-baseballcards2019-Beckham.jpg",
    "age": 29,
    "height": "6-1",
    "weight": 215,
    "arm": "Bats",
    "bats": "Right",
    "season": ".230|45|12|35|1|.287|.374",
    "career": ".252|162|48|151|12|.304|.424",
    "best": "A much better season than he had last year with the Orioles, with his offensive numbers taking a big decline. He also made 19 errors, including 12 in 206 chances at shortstop. The Mariners would be happy with a season similar to 2017 when he hit 22 homers and had a .782 OPS, despite striking out a whopping 167 times and taking only 36 walks.",
    "worst": "Beckham was the first overall selection of the 2008 draft and received a $6.15 million signing bonus from Tampa Bay. … Hit  the 10,000th HR in Baltimore Orioles history in 2017.",
    "credit": "Dean Rutz",
    "publication": "The Seattle Times"
  },
  {
    "order": 10,
    "image": "marcogonzales.jpg",
    "overlay": "left",
    "name": "Marco Gonzales",
    "number": 7,
    "position": "SP",
    "card": "Mariners-baseballcards2019-Marco.jpg",
    "age": 27,
    "height": "6-1",
    "weight": 195,
    "arm": "Throws",
    "bats": "Left",
    "season": "13-9|4.00|29|166.2|0|32|145",
    "career": "18-12|4.46|43|244.0|0|65|209",
    "best": "For him to continue the great progress he made last season, by far his best in the major leagues. Although Gonzales proved he is all the way back from Tommy John surgery that cost him almost all of the 2015 and 2016 seasons, he did wear down a bit in the second half of the season. He pitched a career-high 166 2/3 innings, and the Mariners will need him to pitch at least that many this season.",
    "worst": "He starred at Gonzaga, winning the 2013 John Ole­rud Award, given to college baseball’s best two-way player. He was 7-3 with a 2.80 ERA, and hit .311 while playing first base.",
    "credit": "Dean Rutz",
    "publication": "The Seattle Times"
  }
]